{
    "<pad>": 0,
    "<unk>": 1,
    "<sos>": 2,
    "<eos>": 3,
    ".": 4,
    ",": 5,
    "(": 6,
    ")": 7,
    ":": 8,
    "the": 9,
    "-": 10,
    "'": 11,
    "]": 12,
    "[": 13,
    "a": 14,
    "of": 15,
    "to": 16,
    "=": 17,
    "0": 18,
    "1": 19,
    "in": 20,
    "\"": 21,
    ">": 22,
    "and": 23,
    "for": 24,
    "is": 25,
    "/": 26,
    "2": 27,
    "with": 28,
    "source": 29,
    "3": 30,
    "\u2013": 31,
    "\uf0c1": 32,
    "be": 33,
    "none": 34,
    "#": 35,
    "data": 36,
    "this": 37,
    "as": 38,
    "that": 39,
    "numpy": 40,
    "are": 41,
    "{": 42,
    "}": 43,
    "pandas": 44,
    "if": 45,
    "on": 46,
    "array": 47,
    "or": 48,
    "by": 49,
    "from": 50,
    "4": 51,
    "5": 52,
    "an": 53,
    "can": 54,
    "*": 55,
    "type": 56,
    "structure": 57,
    "out": 58,
    "str": 59,
    "parameters": 60,
    "|": 61,
    "float": 62,
    "list": 63,
    "b": 64,
    "true": 65,
    "01": 66,
    "\\": 67,
    "00": 68,
    "will": 69,
    "not": 70,
    "return": 71,
    "it": 72,
    "7": 73,
    "np": 74,
    "object": 75,
    "false": 76,
    "c": 77,
    "using": 78,
    "dict": 79,
    "x": 80,
    "index": 81,
    "you": 82,
    "+": 83,
    "dtype": 84,
    "pymatgen": 85,
    "6": 86,
    "bool": 87,
    "class": 88,
    "int": 89,
    "series": 90,
    "pd": 91,
    "returns": 92,
    "dataframe": 93,
    "values": 94,
    "use": 95,
    "<": 96,
    "used": 97,
    "one": 98,
    "all": 99,
    "which": 100,
    "number": 101,
    "default": 102,
    "each": 103,
    "8": 104,
    "api": 105,
    "set": 106,
    "e": 107,
    "10": 108,
    "df": 109,
    "value": 110,
    "function": 111,
    "y": 112,
    "file": 113,
    "sklearn": 114,
    "nan": 115,
    "when": 116,
    "i": 117,
    "\u2192": 118,
    "\u00e2": 119,
    "string": 120,
    "9": 121,
    "method": 122,
    "element": 123,
    ";": 124,
    "self": 125,
    "more": 126,
    "input": 127,
    "github": 128,
    "example": 129,
    "name": 130,
    "module": 131,
    "other": 132,
    "two": 133,
    "have": 134,
    "d": 135,
    "learn": 136,
    "k": 137,
    "only": 138,
    "s": 139,
    "python": 140,
    "axis": 141,
    "also": 142,
    "g": 143,
    "where": 144,
    "columns": 145,
    "whether": 146,
    "new": 147,
    "user": 148,
    "site": 149,
    "ndarray": 150,
    "note": 151,
    "see": 152,
    "n": 153,
    "import": 154,
    "get": 155,
    "version": 156,
    "any": 157,
    "at": 158,
    "we": 159,
    "given": 160,
    "objects": 161,
    "feature": 162,
    "model": 163,
    "functions": 164,
    "time": 165,
    "property": 166,
    "no": 167,
    "scikit": 168,
    "same": 169,
    "support": 170,
    "should": 171,
    "arrays": 172,
    "but": 173,
    "random": 174,
    "guide": 175,
    "analysis": 176,
    "may": 177,
    "output": 178,
    "12": 179,
    "release": 180,
    "matrix": 181,
    "regression": 182,
    "learning": 183,
    "different": 184,
    "joblib": 185,
    "order": 186,
    "first": 187,
    "plot": 188,
    "types": 189,
    "has": 190,
    "these": 191,
    "examples": 192,
    "^": 193,
    "methods": 194,
    "https": 195,
    "copy": 196,
    "parameter": 197,
    "11": 198,
    "how": 199,
    "section": 200,
    "column": 201,
    "like": 202,
    "elements": 203,
    "than": 204,
    "reference": 205,
    "offsets": 206,
    "development": 207,
    "energy": 208,
    "non": 209,
    "core": 210,
    "some": 211,
    "features": 212,
    "io": 213,
    "lattice": 214,
    "dataset": 215,
    "code": 216,
    "based": 217,
    "libxcfunc": 218,
    "tuple": 219,
    "classification": 220,
    "shape": 221,
    "into": 222,
    "then": 223,
    "pull": 224,
    "com": 225,
    "between": 226,
    "kernel": 227,
    "memory": 228,
    "estimator": 229,
    "2000": 230,
    "linear": 231,
    "2013": 232,
    "files": 233,
    "models": 234,
    "spin": 235,
    "point": 236,
    "timestamp": 237,
    "molecule": 238,
    "documentation": 239,
    "missing": 240,
    "datasets": 241,
    "bases": 242,
    "test": 243,
    "size": 244,
    "dictionary": 245,
    "defaults": 246,
    "clustering": 247,
    "must": 248,
    "such": 249,
    "most": 250,
    "key": 251,
    "cross": 252,
    "do": 253,
    "as_dict": 254,
    "your": 255,
    "read": 256,
    "tseries": 257,
    "f": 258,
    "float64": 259,
    "result": 260,
    "neighbors": 261,
    "metrics": 262,
    "level": 263,
    "integer": 264,
    "path": 265,
    "species": 266,
    "information": 267,
    "boolean": 268,
    "format": 269,
    "labels": 270,
    "foo": 271,
    "gaussian": 272,
    "add": 273,
    "plotting": 274,
    "its": 275,
    "samples": 276,
    "02": 277,
    "create": 278,
    "operations": 279,
    "structures": 280,
    "label": 281,
    "case": 282,
    "kwargs": 283,
    "05": 284,
    "mean": 285,
    "single": 286,
    "selection": 287,
    "getting": 288,
    "there": 289,
    "error": 290,
    "algorithm": 291,
    "2011": 292,
    "points": 293,
    "indexing": 294,
    "following": 295,
    "r": 296,
    "validation": 297,
    "filename": 298,
    "performance": 299,
    "composition": 300,
    "sparse": 301,
    "16": 302,
    "sequence": 303,
    "20": 304,
    "notes": 305,
    "14": 306,
    "group": 307,
    "specified": 308,
    "materialsproject": 309,
    "run": 310,
    "so": 311,
    "sites": 312,
    "optional": 313,
    "fit": 314,
    "estimators": 315,
    "table": 316,
    "package": 317,
    "defined": 318,
    "p": 319,
    "from_dict": 320,
    "write": 321,
    "comparison": 322,
    "vector": 323,
    "decision": 324,
    "?": 325,
    "symbol": 326,
    "main": 327,
    "15": 328,
    "started": 329,
    "about": 330,
    "names": 331,
    "means": 332,
    "03": 333,
    "bar": 334,
    "m": 335,
    "argument": 336,
    "multiple": 337,
    "13": 338,
    "gradient": 339,
    "install": 340,
    "possible": 341,
    "available": 342,
    "fix": 343,
    "rows": 344,
    "t": 345,
    "representation": 346,
    "jdftxoutfile": 347,
    "density": 348,
    "work": 349,
    "does": 350,
    "indices": 351,
    "sum": 352,
    "datetime": 353,
    "options": 354,
    "&": 355,
    "over": 356,
    "row": 357,
    "compute": 358,
    "instance": 359,
    "length": 360,
    "w": 361,
    "v": 362,
    "groupby": 363,
    "up": 364,
    "text": 365,
    "30": 366,
    "calculation": 367,
    "both": 368,
    "sphinx": 369,
    "entry": 370,
    "they": 371,
    "properties": 372,
    "choose": 373,
    "created": 374,
    "distance": 375,
    "call": 376,
    "ma": 377,
    "previous": 378,
    "strings": 379,
    "instead": 380,
    "provided": 381,
    "make": 382,
    "bug": 383,
    "parallel": 384,
    "jdftxoutfileslice": 385,
    "classes": 386,
    "axes": 387,
    "j": 388,
    "classmethod": 389,
    "multi": 390,
    "need": 391,
    "int64": 392,
    "corresponding": 393,
    "sample": 394,
    "start": 395,
    "%": 396,
    "100": 397,
    "end": 398,
    "frequency": 399,
    "second": 400,
    "page": 401,
    "categorical": 402,
    "standard": 403,
    "unit": 404,
    "h": 405,
    "next": 406,
    "passed": 407,
    "date": 408,
    "25": 409,
    "via": 410,
    "print": 411,
    "days": 412,
    "na": 413,
    "\u2014": 414,
    "entries": 415,
    "training": 416,
    "built": 417,
    "equivalent": 418,
    "categories": 419,
    "target": 420,
    "charge": 421,
    "build": 422,
    "py": 423,
    "freq": 424,
    "back": 425,
    "large": 426,
    "atom": 427,
    "along": 428,
    "many": 429,
    "top": 430,
    "want": 431,
    "nearest": 432,
    "results": 433,
    "changes": 434,
    "while": 435,
    "navigation": 436,
    "show": 437,
    "atoms": 438,
    "dinner": 439,
    "04": 440,
    "specific": 441,
    "us": 442,
    "useful": 443,
    "kpoints": 444,
    "uses": 445,
    "their": 446,
    "here": 447,
    "vasp": 448,
    "provides": 449,
    "17": 450,
    "50": 451,
    "last": 452,
    "would": 453,
    "estimation": 454,
    "range": 455,
    "dimensional": 456,
    "ts": 457,
    "2012": 458,
    "content": 459,
    "svm": 460,
    "backend": 461,
    "three": 462,
    "called": 463,
    "base": 464,
    "very": 465,
    "prediction": 466,
    "tensor": 467,
    "arguments": 468,
    "setting": 469,
    "related": 470,
    "23": 471,
    "hash": 472,
    "apply": 473,
    "was": 474,
    "process": 475,
    "day": 476,
    "either": 477,
    "trees": 478,
    "style": 479,
    "check": 480,
    "way": 481,
    "field": 482,
    "sets": 483,
    "environment": 484,
    "covariance": 485,
    "building": 486,
    "band": 487,
    "line": 488,
    "binary": 489,
    "wise": 490,
    "mode": 491,
    "returned": 492,
    "without": 493,
    "cell": 494,
    "score": 495,
    "multiindex": 496,
    "generate": 497,
    "iterator": 498,
    "algorithms": 499,
    "o": 500,
    "maximum": 501,
    "null": 502,
    "weight": 503,
    "symmetry": 504,
    "details": 505,
    "within": 506,
    "routines": 507,
    "skip": 508,
    "well": 509,
    "attribute": 510,
    "convert": 511,
    "coordinates": 512,
    "18": 513,
    "transform": 514,
    "above": 515,
    "keys": 516,
    "right": 517,
    "common": 518,
    "system": 519,
    "however": 520,
    "supervised": 521,
    "scalar": 522,
    "keyword": 523,
    "configuration": 524,
    "now": 525,
    "06": 526,
    "contains": 527,
    "pass": 528,
    "because": 529,
    "precision": 530,
    "step": 531,
    "allows": 532,
    "split": 533,
    "supported": 534,
    "loss": 535,
    "ufunc": 536,
    "search": 537,
    "coordination": 538,
    "custom": 539,
    "evaluation": 540,
    "dtypes": 541,
    "tree": 542,
    "containing": 543,
    "zero": 544,
    "args": 545,
    "probability": 546,
    "similar": 547,
    "variable": 548,
    "components": 549,
    "matplotlib": 550,
    "z": 551,
    "21": 552,
    "distutils": 553,
    "find": 554,
    "functionality": 555,
    "below": 556,
    "ctrl": 557,
    "additional": 558,
    "factor": 559,
    "dimensions": 560,
    "average": 561,
    "change": 562,
    "detection": 563,
    "22": 564,
    "df2": 565,
    "plane": 566,
    "since": 567,
    "before": 568,
    "dt": 569,
    "added": 570,
    "directory": 571,
    "vectors": 572,
    "pyobject": 573,
    "max": 574,
    "specify": 575,
    "male": 576,
    "07": 577,
    "select": 578,
    "always": 579,
    "31": 580,
    "19": 581,
    "usage": 582,
    "compatibility": 583,
    "operation": 584,
    "dos": 585,
    "what": 586,
    "interface": 587,
    "tests": 588,
    "tips": 589,
    "arr": 590,
    "community": 591,
    "fixes": 592,
    "generated": 593,
    "pipeline": 594,
    "warning": 595,
    "developers": 596,
    "tag": 597,
    "datetime64": 598,
    "08": 599,
    "~": 600,
    "multiclass": 601,
    "real": 602,
    "after": 603,
    "include": 604,
    "attributes": 605,
    "obj": 606,
    "grid": 607,
    "predictions": 608,
    "through": 609,
    "store": 610,
    "representing": 611,
    "tolerance": 612,
    "config": 613,
    "energies": 614,
    "msonable": 615,
    "loop": 616,
    "void": 617,
    "state": 618,
    "27": 619,
    "general": 620,
    "potential": 621,
    "per": 622,
    "inputs": 623,
    "vs": 624,
    "window": 625,
    "total": 626,
    "plots": 627,
    "slab": 628,
    "machine": 629,
    "copyright": 630,
    "errors": 631,
    "category": 632,
    "casting": 633,
    "testing": 634,
    "implementation": 635,
    "them": 636,
    "figure": 637,
    "bit": 638,
    "classifier": 639,
    "otherwise": 640,
    "atomic": 641,
    "pca": 642,
    "2014": 643,
    "image": 644,
    "\\frac": 645,
    "behavior": 646,
    "unsupervised": 647,
    "library": 648,
    "found": 649,
    "year": 650,
    "boosting": 651,
    "basic": 652,
    "been": 653,
    "original": 654,
    "l": 655,
    "potcar": 656,
    "dct": 657,
    "full": 658,
    "loc": 659,
    "ns": 660,
    "period": 661,
    "space": 662,
    "vasprun": 663,
    "occurs": 664,
    "associated": 665,
    "chemical": 666,
    "jdftx": 667,
    "applied": 668,
    "take": 669,
    "local": 670,
    "timedelta": 671,
    "surface": 672,
    "calculate": 673,
    "csv": 674,
    "weights": 675,
    "variables": 676,
    "fixed": 677,
    "project": 678,
    "def": 679,
    "working": 680,
    "metadata": 681,
    "ax": 682,
    "header": 683,
    "preprocessing": 684,
    "\u00a9": 685,
    "npy_intp": 686,
    "bond": 687,
    "json": 688,
    "24": 689,
    "floating": 690,
    "cannot": 691,
    "being": 692,
    "iris": 693,
    "fields": 694,
    "reduction": 695,
    "datetimeindex": 696,
    "cases": 697,
    "high": 698,
    "threshold": 699,
    "decomposition": 700,
    "calculations": 701,
    "another": 702,
    "poscar": 703,
    "groups": 704,
    "mixture": 705,
    "ridge": 706,
    "form": 707,
    "static": 708,
    "2025": 709,
    "raise": 710,
    "automatically": 711,
    "complex": 712,
    "compare": 713,
    "flags": 714,
    "month": 715,
    "least": 716,
    "negative": 717,
    "simple": 718,
    "co": 719,
    "outlier": 720,
    "stored": 721,
    "dimension": 722,
    "manual": 723,
    "fitting": 724,
    "display": 725,
    "minimum": 726,
    "materials": 727,
    "pr": 728,
    "settings": 729,
    "sun": 730,
    "pathlike": 731,
    "extensions": 732,
    "units": 733,
    "theme": 734,
    "unique": 735,
    "particular": 736,
    "done": 737,
    "left": 738,
    "cluster": 739,
    "match": 740,
    "valid": 741,
    "faq": 742,
    "yes": 743,
    "glossary": 744,
    "provide": 745,
    "joutstructure": 746,
    "even": 747,
    "option": 748,
    "\\text": 749,
    "contributors": 750,
    "partial": 751,
    "load": 752,
    "formula": 753,
    "recent": 754,
    "individual": 755,
    "dimensionality": 756,
    "fe": 757,
    "engine": 758,
    "mapping": 759,
    "html": 760,
    "recommended": 761,
    "equal": 762,
    "highlights": 763,
    "cutoff": 764,
    "exception": 765,
    "those": 766,
    "currently": 767,
    "keywords": 768,
    "u": 769,
    "projects": 770,
    "joutstructures": 771,
    "09": 772,
    "lines": 773,
    "pyarrow": 774,
    "perform": 775,
    "including": 776,
    "structured": 777,
    "functional": 778,
    "neighbor": 779,
    "steps": 780,
    "allow": 781,
    "kernels": 782,
    "kind": 783,
    "part": 784,
    "governance": 785,
    "random_state": 786,
    "@janosh": 787,
    "parsing": 788,
    "might": 789,
    "th": 790,
    "plt": 791,
    "alpha": 792,
    "randn": 793,
    "color": 794,
    "orbital": 795,
    "subset": 796,
    "28": 797,
    "2020": 798,
    "tuning": 799,
    "female": 800,
    "graph": 801,
    "access": 802,
    "just": 803,
    "references": 804,
    "history": 805,
    "pydata": 806,
    "iteration": 807,
    "scale": 808,
    "present": 809,
    "outcar": 810,
    "distribution": 811,
    "constructor": 812,
    "under": 813,
    "clf": 814,
    "scoring": 815,
    "directly": 816,
    "\u2026": 817,
    "advanced": 818,
    "typing": 819,
    "2019": 820,
    "loading": 821,
    "000000": 822,
    "improvements": 823,
    "please": 824,
    "etc": 825,
    "alias": 826,
    "constant": 827,
    "needed": 828,
    "valueerror": 829,
    "regularization": 830,
    "supports": 831,
    "func": 832,
    "importance": 833,
    "jdftxinfile": 834,
    "numbers": 835,
    "determine": 836,
    "normalize": 837,
    "tools": 838,
    "contain": 839,
    "reading": 840,
    "2d": 841,
    "often": 842,
    "cat": 843,
    "deprecated": 844,
    "from_file": 845,
    "comparing": 846,
    "transformations": 847,
    "processes": 848,
    "sort": 849,
    "positive": 850,
    "vaspinputset": 851,
    "29": 852,
    "normal": 853,
    "roadmap": 854,
    "scaling": 855,
    "writing": 856,
    "less": 857,
    "robust": 858,
    "implements": 859,
    "radius": 860,
    "times": 861,
    "small": 862,
    "coefficients": 863,
    "calibration": 864,
    "twitter": 865,
    "mastodon": 866,
    "remove": 867,
    "mn": 868,
    "factory": 869,
    "join": 870,
    "control": 871,
    "neps": 872,
    "computing": 873,
    "view": 874,
    "basis": 875,
    "\u00b6": 876,
    "ev": 877,
    "long": 878,
    "lower": 879,
    "!": 880,
    "literal": 881,
    "scores": 882,
    "various": 883,
    "formats": 884,
    "users": 885,
    "location": 886,
    "better": 887,
    "works": 888,
    "parse": 889,
    "libraries": 890,
    "count": 891,
    "during": 892,
    "\\hat": 893,
    "cp2k": 894,
    "offset": 895,
    "arange": 896,
    "predict": 897,
    "tol": 898,
    "min": 899,
    "requires": 900,
    "thus": 901,
    "lasso": 902,
    "considered": 903,
    "network": 904,
    "best": 905,
    "passing": 906,
    "problems": 907,
    "geometry": 908,
    "usually": 909,
    "required": 910,
    "read_csv": 911,
    "replace": 912,
    "v2": 913,
    "docs": 914,
    "good": 915,
    "visualization": 916,
    "styler": 917,
    "char": 918,
    "manifold": 919,
    "transformation": 920,
    "ordered": 921,
    "temperature": 922,
    "32": 923,
    "computed": 924,
    "levels": 925,
    "rotation": 926,
    "classifiers": 927,
    "existing": 928,
    "raised": 929,
    "59": 930,
    "approximation": 931,
    "neural": 932,
    "from_str": 933,
    "integers": 934,
    "polynomial": 935,
    "periods": 936,
    "strategies": 937,
    "phase": 938,
    "lobster": 939,
    "handle": 940,
    "extension": 941,
    "current": 942,
    "sat": 943,
    "mo": 944,
    "\u201d": 945,
    "kpoint": 946,
    "avoid": 947,
    "our": 948,
    "slice": 949,
    "_": 950,
    "update": 951,
    "40": 952,
    "permutation": 953,
    "angle": 954,
    "1e": 955,
    "99": 956,
    "initial": 957,
    "fractional": 958,
    "stochastic": 959,
    "incar": 960,
    "org": 961,
    "merge": 962,
    "takes": 963,
    "much": 964,
    "several": 965,
    "description": 966,
    "scipy": 967,
    "pyarrayobject": 968,
    "y_true": 969,
    "istructure": 970,
    "multioutput": 971,
    "26": 972,
    "calling": 973,
    "strategy": 974,
    "extraction": 975,
    "q": 976,
    "known": 977,
    "rolling": 978,
    "certain": 979,
    "low": 980,
    "weighted": 981,
    "try": 982,
    "map": 983,
    "ensemble": 984,
    "elementbase": 985,
    "tables": 986,
    "query": 987,
    "75": 988,
    "projection": 989,
    "running": 990,
    "flag": 991,
    "cache": 992,
    "tags": 993,
    "ni": 994,
    "lists": 995,
    "character": 996,
    "complexity": 997,
    "distances": 998,
    "position": 999,
    "define": 1000,
    "64": 1001,
    "component": 1002,
    "cartesian": 1003,
    "pairwise": 1004,
    "chemenv": 1005,
    "summary": 1006,
    "title": 1007,
    "nested": 1008,
    "utils": 1009,
    "prior": 1010,
    "empty": 1011,
    "global": 1012,
    "logistic": 1013,
    "implemented": 1014,
    "estimate": 1015,
    "coords": 1016,
    "y_pred": 1017,
    "optimization": 1018,
    "ratio": 1019,
    "specifying": 1020,
    "demo": 1021,
    "cp2koutput": 1022,
    "cr": 1023,
    "handling": 1024,
    "conversion": 1025,
    "42": 1026,
    "states": 1027,
    "initialize": 1028,
    "metric": 1029,
    "written": 1030,
    "still": 1031,
    "matching": 1032,
    "sub": 1033,
    "absolute": 1034,
    "typically": 1035,
    "according": 1036,
    "width": 1037,
    "naive": 1038,
    "evaluate": 1039,
    "reshape": 1040,
    "creating": 1041,
    "faster": 1042,
    "1000": 1043,
    "x_i": 1044,
    "issues": 1045,
    "command": 1046,
    "frame": 1047,
    "outputs": 1048,
    "n_jobs": 1049,
    "xml": 1050,
    "limit": 1051,
    "final": 1052,
    "std": 1053,
    "inverse": 1054,
    "product": 1055,
    "effect": 1056,
    "doc": 1057,
    "clusters": 1058,
    "matrices": 1059,
    "combine": 1060,
    "selecting": 1061,
    "exceptions": 1062,
    "compatible": 1063,
    "represents": 1064,
    "mathematical": 1065,
    "place": 1066,
    "double": 1067,
    "center": 1068,
    "pyarray_descr": 1069,
    "fermi": 1070,
    "statistics": 1071,
    "installed": 1072,
    "conditional": 1073,
    "context": 1074,
    "mask": 1075,
    "actual": 1076,
    "variance": 1077,
    "struct": 1078,
    "linear_model": 1079,
    "submodules": 1080,
    "refer": 1081,
    "\\sum_": 1082,
    "pip": 1083,
    "included": 1084,
    "scalars": 1085,
    "lib": 1086,
    "excel": 1087,
    "problem": 1088,
    "important": 1089,
    "consider": 1090,
    "made": 1091,
    "universal": 1092,
    "arraylike": 1093,
    "pointer": 1094,
    "continuous": 1095,
    "could": 1096,
    "together": 1097,
    "generic": 1098,
    "log": 1099,
    "descent": 1100,
    "gga": 1101,
    "moleculegraph": 1102,
    "strain": 1103,
    "experimental": 1104,
    "info": 1105,
    "bytes": 1106,
    "hierarchical": 1107,
    "lambda": 1108,
    "curves": 1109,
    "volume": 1110,
    "digits": 1111,
    "versions": 1112,
    "aims": 1113,
    "license": 1114,
    "sex": 1115,
    "df1": 1116,
    "2007": 1117,
    "force": 1118,
    "semi": 1119,
    "pipelines": 1120,
    "x1": 1121,
    "write_file": 1122,
    "forests": 1123,
    "oxidation": 1124,
    "efficient": 1125,
    "pre": 1126,
    "explicitly": 1127,
    "special": 1128,
    "id": 1129,
    "resulting": 1130,
    "x2": 1131,
    "processing": 1132,
    "world": 1133,
    "installation": 1134,
    "external": 1135,
    "extra": 1136,
    "environments": 1137,
    "phasediagram": 1138,
    "issue": 1139,
    "2008": 1140,
    "calls": 1141,
    "pseudo": 1142,
    "gap": 1143,
    "callable": 1144,
    "except": 1145,
    "converted": 1146,
    "len": 1147,
    "setup": 1148,
    "measure": 1149,
    "stress": 1150,
    "necessary": 1151,
    "calculated": 1152,
    "close": 1153,
    "l1": 1154,
    "predicted": 1155,
    "accuracy": 1156,
    "bonds": 1157,
    "structureenvironments": 1158,
    "open": 1159,
    "already": 1160,
    "corresponds": 1161,
    "byte": 1162,
    "requests": 1163,
    "performed": 1164,
    "resources": 1165,
    "future": 1166,
    "td": 1167,
    "curve": 1168,
    "biclustering": 1169,
    "model_selection": 1170,
    "ion": 1171,
    "area": 1172,
    "internal": 1173,
    "iloc": 1174,
    "once": 1175,
    "dft": 1176,
    "n_samples": 1177,
    "computedentry": 1178,
    "grouped": 1179,
    "numerical": 1180,
    "dataframegroupby": 1181,
    "documents": 1182,
    "require": 1183,
    "op": 1184,
    "computational": 1185,
    "bayes": 1186,
    "help": 1187,
    "addition": 1188,
    "inner": 1189,
    "pickle": 1190,
    "parallelism": 1191,
    "higher": 1192,
    "rather": 1193,
    "ensure": 1194,
    "35": 1195,
    "therefore": 1196,
    "construct": 1197,
    "periodic": 1198,
    "magnetic": 1199,
    "polarization": 1200,
    "fortran": 1201,
    "shift": 1202,
    "dependence": 1203,
    "toy": 1204,
    "sections": 1205,
    "automatic": 1206,
    "quality": 1207,
    "desired": 1208,
    "cost": 1209,
    "linalg": 1210,
    "power": 1211,
    "creation": 1212,
    "thread": 1213,
    "week": 1214,
    "degrees": 1215,
    "were": 1216,
    "al": 1217,
    "imputation": 1218,
    "larger": 1219,
    "date_range": 1220,
    "\\n": 1221,
    "underlying": 1222,
    "fast": 1223,
    "seriesgroupby": 1224,
    "amount": 1225,
    "rules": 1226,
    "cpu": 1227,
    "edges": 1228,
    "sgd": 1229,
    "further": 1230,
    "sorting": 1231,
    "operator": 1232,
    "2016": 1233,
    "depending": 1234,
    "itself": 1235,
    "sitecollection": 1236,
    "lammps": 1237,
    "electrons": 1238,
    "dates": 1239,
    "packages": 1240,
    "topic": 1241,
    "arbitrary": 1242,
    "makes": 1243,
    "side": 1244,
    "re": 1245,
    "item": 1246,
    "masked": 1247,
    "\\alpha": 1248,
    "numpy\u2019s": 1249,
    "inspection": 1250,
    "numeric": 1251,
    "indexes": 1252,
    "updates": 1253,
    "timedelta64": 1254,
    "iter": 1255,
    "qcinput": 1256,
    "interval": 1257,
    "nat": 1258,
    "every": 1259,
    "resample": 1260,
    "ser": 1261,
    "periodicsite": 1262,
    "trajectory": 1263,
    "sql": 1264,
    "obtained": 1265,
    "2024": 1266,
    "document": 1267,
    "items": 1268,
    "dev": 1269,
    "train": 1270,
    "baz": 1271,
    "correct": 1272,
    "transformer": 1273,
    "initialization": 1274,
    "discriminant": 1275,
    "gamma": 1276,
    "simply": 1277,
    "team": 1278,
    "sorted": 1279,
    "col1": 1280,
    "needs": 1281,
    "relative": 1282,
    "removed": 1283,
    "molecules": 1284,
    "jelsteps": 1285,
    "neighborsset": 1286,
    "speed": 1287,
    "38": 1288,
    "represent": 1289,
    "34": 1290,
    "const": 1291,
    "comment": 1292,
    "dftset": 1293,
    "slicing": 1294,
    "parser": 1295,
    "represented": 1296,
    "across": 1297,
    "fill_value": 1298,
    "direction": 1299,
    "diagram": 1300,
    "aimsoutcalcchunk": 1301,
    "computation": 1302,
    "git": 1303,
    "transforming": 1304,
    "tuples": 1305,
    "instances": 1306,
    "spectral": 1307,
    "multilabel": 1308,
    "pattern": 1309,
    "keep": 1310,
    "expected": 1311,
    "loops": 1312,
    "normalized": 1313,
    "sigma": 1314,
    "scheme": 1315,
    "routing": 1316,
    "conda": 1317,
    "duplicate": 1318,
    "selected": 1319,
    "management": 1320,
    "named": 1321,
    "generally": 1322,
    "systems": 1323,
    "machines": 1324,
    "novelty": 1325,
    "head": 1326,
    "request": 1327,
    "what\u00e2\u0080\u0099s": 1328,
    "tz": 1329,
    "own": 1330,
    "angles": 1331,
    "electronic": 1332,
    "block": 1333,
    "reduce": 1334,
    "square": 1335,
    "33": 1336,
    "astype": 1337,
    "broadcasting": 1338,
    "verbose": 1339,
    "too": 1340,
    "determined": 1341,
    "persistence": 1342,
    "rbf": 1343,
    "@danielyang59": 1344,
    "2018": 1345,
    "0000": 1346,
    "defines": 1347,
    "regular": 1348,
    "encoding": 1349,
    "voting": 1350,
    "abinit": 1351,
    "ordering": 1352,
    "protocol": 1353,
    "2015": 1354,
    "80": 1355,
    "total_bill": 1356,
    "append": 1357,
    "raises": 1358,
    "bandstructure": 1359,
    "potcarsingle": 1360,
    "56": 1361,
    "save": 1362,
    "includes": 1363,
    "quarter": 1364,
    "factorization": 1365,
    "task": 1366,
    "magmom": 1367,
    "flexible": 1368,
    "51": 1369,
    "assigned": 1370,
    "moment": 1371,
    "whose": 1372,
    "appropriate": 1373,
    "down": 1374,
    "elastic": 1375,
    "cv": 1376,
    "periodindex": 1377,
    "difference": 1378,
    "ones": 1379,
    "due": 1380,
    "meta": 1381,
    "auto": 1382,
    "contiguous": 1383,
    "n_": 1384,
    "isotonic": 1385,
    "scf": 1386,
    "inc": 1387,
    "stata": 1388,
    "few": 1389,
    "gb": 1390,
    "60": 1391,
    "pairs": 1392,
    "buffer": 1393,
    "2010": 1394,
    "k0": 1395,
    "migration": 1396,
    "lda": 1397,
    "coordinationgeometry": 1398,
    "expression": 1399,
    "changed": 1400,
    "checking": 1401,
    "quantile": 1402,
    "parent": 1403,
    "c1": 1404,
    "boundary": 1405,
    "discrete": 1406,
    "ensembles": 1407,
    "cohp": 1408,
    "efermi": 1409,
    "bsd": 1410,
    "short": 1411,
    "starting": 1412,
    "67": 1413,
    "give": 1414,
    "idx": 1415,
    "quadratic": 1416,
    "meson": 1417,
    "expectation": 1418,
    "x_test": 1419,
    "jdftxstructure": 1420,
    "third": 1421,
    "rng": 1422,
    "paths": 1423,
    "gridsearchcv": 1424,
    "mprester": 1425,
    "utilities": 1426,
    "cast": 1427,
    "traceback": 1428,
    "template": 1429,
    "bagging": 1430,
    "doping": 1431,
    "tutorials": 1432,
    "adding": 1433,
    "dependencies": 1434,
    "around": 1435,
    "having": 1436,
    "criteria": 1437,
    "terms": 1438,
    "runs": 1439,
    "embedding": 1440,
    "ionic": 1441,
    "jelstep": 1442,
    "security": 1443,
    "look": 1444,
    "45": 1445,
    "drop": 1446,
    "92": 1447,
    "90": 1448,
    "post": 1449,
    "li": 1450,
    "ways": 1451,
    "expanding": 1452,
    "finding": 1453,
    "explicit": 1454,
    "maskedarray": 1455,
    "implement": 1456,
    "node": 1457,
    "composite": 1458,
    "k\\": 1459,
    "x_train": 1460,
    "qchem": 1461,
    "lightstructureenvironments": 1462,
    "gaussianoutput": 1463,
    "orbitals": 1464,
    "overview": 1465,
    "box": 1466,
    "approach": 1467,
    "versus": 1468,
    "hour": 1469,
    "making": 1470,
    "reindex": 1471,
    "described": 1472,
    "correlation": 1473,
    "coordinate": 1474,
    "hosted": 1475,
    "extract": 1476,
    "gives": 1477,
    "align": 1478,
    "titanic": 1479,
    "describe": 1480,
    "chosen": 1481,
    "status": 1482,
    "norm": 1483,
    "principal": 1484,
    "cif": 1485,
    "warnings": 1486,
    "sure": 1487,
    "95": 1488,
    "follows": 1489,
    "exact": 1490,
    "respect": 1491,
    "stacking": 1492,
    "iterations": 1493,
    "hyper": 1494,
    "numfocus": 1495,
    "database": 1496,
    "indicates": 1497,
    "cython": 1498,
    "tasks": 1499,
    "else": 1500,
    "specifies": 1501,
    "numeric_only": 1502,
    "78": 1503,
    "choosing": 1504,
    "upper": 1505,
    "squares": 1506,
    "stringio": 1507,
    "definition": 1508,
    "targets": 1509,
    "itemsize": 1510,
    "resource": 1511,
    "get_str": 1512,
    "prefix": 1513,
    "produce": 1514,
    "business": 1515,
    "interpreted": 1516,
    "fill": 1517,
    "tip": 1518,
    "likelihood": 1519,
    "y_i": 1520,
    "specie": 1521,
    "dielectric": 1522,
    "46": 1523,
    "requested": 1524,
    "float32": 1525,
    "mu": 1526,
    "svc": 1527,
    "contributing": 1528,
    "ovhcloud": 1529,
    "able": 1530,
    "raw": 1531,
    "43": 1532,
    "free": 1533,
    "relevant": 1534,
    "seconds": 1535,
    "smaller": 1536,
    "constraints": 1537,
    "choice": 1538,
    "rule": 1539,
    "edge": 1540,
    "eigenvalues": 1541,
    "roc": 1542,
    "structuregraph": 1543,
    "nullable": 1544,
    "respectively": 1545,
    "convenience": 1546,
    "reduced": 1547,
    "computedstructureentry": 1548,
    "easy": 1549,
    "layout": 1550,
    "subsections": 1551,
    "matches": 1552,
    "generator": 1553,
    "computationally": 1554,
    "outliers": 1555,
    "faces": 1556,
    "extensionarray": 1557,
    "meaning": 1558,
    "consistent": 1559,
    "squared": 1560,
    "constants": 1561,
    "primitive": 1562,
    "pitfalls": 1563,
    "signals": 1564,
    "localgeometryfinder": 1565,
    "stable": 1566,
    "2017": 1567,
    "platform": 1568,
    "merged": 1569,
    "likely": 1570,
    "creates": 1571,
    "48": 1572,
    "defining": 1573,
    "lobsterout": 1574,
    "download": 1575,
    "condition": 1576,
    "combination": 1577,
    "rename": 1578,
    "shows": 1579,
    "greater": 1580,
    "zeros": 1581,
    "script": 1582,
    "dump": 1583,
    "propagation": 1584,
    "permutations": 1585,
    "feff": 1586,
    "entire": 1587,
    "deprecations": 1588,
    "windows": 1589,
    "checks": 1590,
    "origin": 1591,
    "39": 1592,
    "parsed": 1593,
    "though": 1594,
    "000": 1595,
    "computes": 1596,
    "histogram": 1597,
    "voronoi": 1598,
    "optimade": 1599,
    "pdentry": 1600,
    "basisinfo": 1601,
    "optimizations": 1602,
    "dateoffset": 1603,
    "compiler": 1604,
    "obtain": 1605,
    "indicating": 1606,
    "135632": 1607,
    "rest": 1608,
    "typeerror": 1609,
    "bands": 1610,
    "evaluating": 1611,
    "generalized": 1612,
    "fitted": 1613,
    "coefficient": 1614,
    "enumerator": 1615,
    "volumetricdata": 1616,
    "providing": 1617,
    "boxplot": 1618,
    "alternative": 1619,
    "why": 1620,
    "compression": 1621,
    "66": 1622,
    "contents": 1623,
    "sometimes": 1624,
    "c2": 1625,
    "validate": 1626,
    "beta": 1627,
    "neighborhood": 1628,
    "miller": 1629,
    "electron": 1630,
    "improve": 1631,
    "truth": 1632,
    "serialization": 1633,
    "updated": 1634,
    "61": 1635,
    "separate": 1636,
    "term": 1637,
    "68": 1638,
    "rank": 1639,
    "inf": 1640,
    "depends": 1641,
    "allowed": 1642,
    "codes": 1643,
    "reciprocal": 1644,
    "probabilistic": 1645,
    "symmop": 1646,
    "wulffshape": 1647,
    "voltage": 1648,
    "smearing": 1649,
    "sources": 1650,
    "statistical": 1651,
    "assign": 1652,
    "utc": 1653,
    "off": 1654,
    "math": 1655,
    "kwds": 1656,
    "symbols": 1657,
    "visualizations": 1658,
    "\\in": 1659,
    "similarly": 1660,
    "pivot": 1661,
    "indexer": 1662,
    "docstring": 1663,
    "complete": 1664,
    "logic": 1665,
    "parts": 1666,
    "subclass": 1667,
    "strides": 1668,
    "doi": 1669,
    "median": 1670,
    "shown": 1671,
    "aligned": 1672,
    "nodes": 1673,
    "swig": 1674,
    "fft": 1675,
    "descr": 1676,
    "convergence": 1677,
    "correction": 1678,
    "converting": 1679,
    "conditions": 1680,
    "positions": 1681,
    "44": 1682,
    "word": 1683,
    "lead": 1684,
    "55": 1685,
    "96": 1686,
    "effective": 1687,
    "qux": 1688,
    "hand": 1689,
    "major": 1690,
    "d1": 1691,
    "stage": 1692,
    "reaction": 1693,
    "sphere": 1694,
    "nearneighbors": 1695,
    "aimsoutheaderchunk": 1696,
    "minutes": 1697,
    "accessor": 1698,
    "returning": 1699,
    "assignment": 1700,
    "stack": 1701,
    "ufuncs": 1702,
    "54": 1703,
    "exactly": 1704,
    "copies": 1705,
    "identical": 1706,
    "pa": 1707,
    "near": 1708,
    "fold": 1709,
    "estimates": 1710,
    "tensors": 1711,
    "kmeans": 1712,
    "inside": 1713,
    "zone": 1714,
    "stop": 1715,
    "sampling": 1716,
    "evaluated": 1717,
    "98": 1718,
    "applies": 1719,
    "signature": 1720,
    "n\\": 1721,
    "tr": 1722,
    "si": 1723,
    "fraction": 1724,
    "gpc": 1725,
    "completedos": 1726,
    "abstractelectrode": 1727,
    "lammpsinputfile": 1728,
    "isite": 1729,
    "filter": 1730,
    "36": 1731,
    "observations": 1732,
    "slices": 1733,
    "unless": 1734,
    "unsigned": 1735,
    "d0": 1736,
    "diagonal": 1737,
    "solver": 1738,
    "bayesian": 1739,
    "elastictensor": 1740,
    "abstractvoltagepair": 1741,
    "compared": 1742,
    "namespace": 1743,
    "linux": 1744,
    "$": 1745,
    "52": 1746,
    "round": 1747,
    "81": 1748,
    "a2": 1749,
    "accessed": 1750,
    "disk": 1751,
    "practices": 1752,
    "ms": 1753,
    "dense": 1754,
    "xx": 1755,
    "3x3": 1756,
    "dbscan": 1757,
    "yaml": 1758,
    "aggregation": 1759,
    "manipulation": 1760,
    "arithmetic": 1761,
    "account": 1762,
    "strict": 1763,
    "characters": 1764,
    "58": 1765,
    "53": 1766,
    "link": 1767,
    "words": 1768,
    "videos": 1769,
    "mass": 1770,
    "boundaries": 1771,
    "macro": 1772,
    "oas": 1773,
    "university": 1774,
    "projected": 1775,
    "wavecar": 1776,
    "repository": 1777,
    "fig": 1778,
    "49": 1779,
    "largest": 1780,
    "77": 1781,
    "inplace": 1782,
    "bins": 1783,
    "enough": 1784,
    "images": 1785,
    "projections": 1786,
    "crystal": 1787,
    "abstracttag": 1788,
    "nbands": 1789,
    "know": 1790,
    "miscellaneous": 1791,
    "bounds": 1792,
    "operating": 1793,
    "ignore": 1794,
    "1d": 1795,
    "int32": 1796,
    "82": 1797,
    "notation": 1798,
    "ground": 1799,
    "indicate": 1800,
    "family": 1801,
    "controls": 1802,
    "dot": 1803,
    "advice": 1804,
    "\\log": 1805,
    "nd": 1806,
    "dispatching": 1807,
    "fit_transform": 1808,
    "ij": 1809,
    "jdftxoutputs": 1810,
    "ce": 1811,
    "pseudotable": 1812,
    "aimsoutput": 1813,
    "incar_updates": 1814,
    "parquet": 1815,
    "concatenate": 1816,
    "construction": 1817,
    "safety": 1818,
    "age": 1819,
    "outer": 1820,
    "easier": 1821,
    "abc": 1822,
    "height": 1823,
    "212112": 1824,
    "df3": 1825,
    "adjustment": 1826,
    "is_month_start": 1827,
    "is_month_end": 1828,
    "affinities": 1829,
    "potentials": 1830,
    "wavefunction": 1831,
    "angstrom": 1832,
    "reshaping": 1833,
    "backwards": 1834,
    "modified": 1835,
    "correspond": 1836,
    "props": 1837,
    "is_year_end": 1838,
    "domain": 1839,
    "critical": 1840,
    "\u2019": 1841,
    "et": 1842,
    "trained": 1843,
    "relaxation": 1844,
    "reciprocal_density": 1845,
    "charges": 1846,
    "dataframes": 1847,
    "dependency": 1848,
    "internally": 1849,
    "pytest": 1850,
    "doing": 1851,
    "ndarrays": 1852,
    "practice": 1853,
    "71": 1854,
    "sep": 1855,
    "ignored": 1856,
    "s1": 1857,
    "longer": 1858,
    "subclasses": 1859,
    "xyz": 1860,
    "2005": 1861,
    "probabilities": 1862,
    "repeat": 1863,
    "is_quarter_start": 1864,
    "is_quarter_end": 1865,
    "is_year_start": 1866,
    "contribution": 1867,
    "it\u2019s": 1868,
    "independent": 1869,
    "bigger": 1870,
    "talks": 1871,
    "forest": 1872,
    "univariate": 1873,
    "y_train": 1874,
    "0001": 1875,
    "ac": 1876,
    "lobsterin": 1877,
    "cow": 1878,
    "application": 1879,
    "minute": 1880,
    "activate": 1881,
    "alignment": 1882,
    "floats": 1883,
    "reverse": 1884,
    "73": 1885,
    "smoker": 1886,
    "f4": 1887,
    "filled": 1888,
    "breaking": 1889,
    "c3": 1890,
    "k1": 1891,
    "accurate": 1892,
    "freqstr": 1893,
    "f2py": 1894,
    "optics": 1895,
    "radii": 1896,
    "css": 1897,
    "resampling": 1898,
    "intervalindex": 1899,
    "2021": 1900,
    "assumed": 1901,
    "algebra": 1902,
    "cause": 1903,
    "forces": 1904,
    "penalty": 1905,
    "seed": 1906,
    "recall": 1907,
    "abstract": 1908,
    "layer": 1909,
    "threads": 1910,
    "simd": 1911,
    "exchange": 1912,
    "quantifying": 1913,
    "loky": 1914,
    "chem": 1915,
    "symprec": 1916,
    "eu": 1917,
    "calc_type": 1918,
    "derived": 1919,
    "indexed": 1920,
    "businesshour": 1921,
    "requirements": 1922,
    "typical": 1923,
    "john": 1924,
    "200": 1925,
    "37": 1926,
    "override": 1927,
    "i4": 1928,
    "packaging": 1929,
    "shrinkage": 1930,
    "n_features": 1931,
    "ase": 1932,
    "dummyspecies": 1933,
    "timedeltaindex": 1934,
    "unicode": 1935,
    "commit": 1936,
    "put": 1937,
    "branch": 1938,
    "generation": 1939,
    "bits": 1940,
    "actually": 1941,
    "col2": 1942,
    "70": 1943,
    "b2": 1944,
    "performing": 1945,
    "sequences": 1946,
    "never": 1947,
    "l2": 1948,
    "i\\": 1949,
    "descriptor": 1950,
    "multiprocessing": 1951,
    "spectrum": 1952,
    "decomposing": 1953,
    "convex": 1954,
    "ag": 1955,
    "inherit_incar": 1956,
    "sas": 1957,
    "clean": 1958,
    "modules": 1959,
    "hdfstore": 1960,
    "manager": 1961,
    "especially": 1962,
    "accept": 1963,
    "consists": 1964,
    "taken": 1965,
    "bad": 1966,
    "s2": 1967,
    "half": 1968,
    "root": 1969,
    "res": 1970,
    "improved": 1971,
    "connectivity": 1972,
    "matlab": 1973,
    "net": 1974,
    "linearsvc": 1975,
    "pbe": 1976,
    "valence": 1977,
    "procar": 1978,
    "lammpsdata": 1979,
    "xas": 1980,
    "numba": 1981,
    "eval": 1982,
    "helper": 1983,
    "os": 1984,
    "aliases": 1985,
    "173215": 1986,
    "76": 1987,
    "changing": 1988,
    "interoperability": 1989,
    "pair": 1990,
    "validated": 1991,
    "cross_val_score": 1992,
    "svr": 1993,
    "connectedcomponent": 1994,
    "gthpotential": 1995,
    "parallel_config": 1996,
    "installing": 1997,
    "concat": 1998,
    "cut": 1999,
    "differences": 2000,
    "computations": 2001,
    "counts": 2002,
    "41": 2003,
    "translation": 2004,
    "red": 2005,
    "57": 2006,
    "constructed": 2007,
    "accepts": 2008,
    "skipna": 2009,
    "transformed": 2010,
    "\\\\": 2011,
    "rate": 2012,
    "tumour": 2013,
    "comp": 2014,
    "nanos": 2015,
    "rule_code": 2016,
    "is_anchored": 2017,
    "is_on_offset": 2018,
    "blas": 2019,
    "early": 2020,
    "noise": 2021,
    "y_test": 2022,
    "basicabinitinput": 2023,
    "online": 2024,
    "fundamentals": 2025,
    "basics": 2026,
    "formatting": 2027,
    "generating": 2028,
    "report": 2029,
    "optimized": 2030,
    "intended": 2031,
    "others": 2032,
    "agg": 2033,
    "244": 2034,
    "47": 2035,
    "282863": 2036,
    "sides": 2037,
    "recommend": 2038,
    "mixed": 2039,
    "modify": 2040,
    "native": 2041,
    "promotion": 2042,
    "similarity": 2043,
    "detailed": 2044,
    "convenient": 2045,
    "quick": 2046,
    "hdf5": 2047,
    "ipython": 2048,
    "frequencies": 2049,
    "storing": 2050,
    "datetimes": 2051,
    "something": 2052,
    "active": 2053,
    "constructing": 2054,
    "_libs": 2055,
    "yield": 2056,
    "rand": 2057,
    "attempt": 2058,
    "cu": 2059,
    "supplied": 2060,
    "se": 2061,
    "resampler": 2062,
    "measures": 2063,
    "ot": 2064,
    "sign": 2065,
    "mesh": 2066,
    "regressor": 2067,
    "empirical": 2068,
    "standardscaler": 2069,
    "delayed": 2070,
    "scorer": 2071,
    "simplestchemenvstrategy": 2072,
    "aimscube": 2073,
    "iterating": 2074,
    "old": 2075,
    "combined": 2076,
    "visualizing": 2077,
    "to_numpy": 2078,
    "aware": 2079,
    "syntax": 2080,
    "1999": 2081,
    "correctly": 2082,
    "serializable": 2083,
    "cm": 2084,
    "ci": 2085,
    "member": 2086,
    "perceptron": 2087,
    "temp": 2088,
    "tutorial": 2089,
    "easily": 2090,
    "produces": 2091,
    "air_quality": 2092,
    "solution": 2093,
    "val": 2094,
    "aaa": 2095,
    "determines": 2096,
    "taking": 2097,
    "smallest": 2098,
    "separation": 2099,
    "chunk": 2100,
    "implementations": 2101,
    "criterion": 2102,
    "bound": 2103,
    "ndim": 2104,
    "operands": 2105,
    "stopping": 2106,
    "randomized": 2107,
    "sample_weight": 2108,
    "corrections": 2109,
    "magmoms": 2110,
    "transformedstructure": 2111,
    "pcm": 2112,
    "slabs": 2113,
    "angstroms": 2114,
    "gaussiantypeorbitalbasisset": 2115,
    "\u00e2\u0080\u00a6": 2116,
    "printed": 2117,
    "enhancements": 2118,
    "applications": 2119,
    "insert": 2120,
    "limited": 2121,
    "applying": 2122,
    "whole": 2123,
    "go": 2124,
    "dropna": 2125,
    "469112": 2126,
    "119209": 2127,
    "url": 2128,
    "against": 2129,
    "cells": 2130,
    "dog": 2131,
    "precomputed": 2132,
    "dependent": 2133,
    "cd": 2134,
    "operand": 2135,
    "simulation": 2136,
    "predict_proba": 2137,
    "velocities": 2138,
    "temcalculator": 2139,
    "cl": 2140,
    "bandgap": 2141,
    "abstractenvironmentnode": 2142,
    "abstractchemenvstrategy": 2143,
    "detailedvoronoicontainer": 2144,
    "integration": 2145,
    "software": 2146,
    "aggregate": 2147,
    "97": 2148,
    "ability": 2149,
    "intervals": 2150,
    "ne": 2151,
    "pipe": 2152,
    "b1": 2153,
    "varying": 2154,
    "misc": 2155,
    "molecular": 2156,
    "inputset": 2157,
    "questions": 2158,
    "indicator": 2159,
    "labeled": 2160,
    "headers": 2161,
    "performs": 2162,
    "accessible": 2163,
    "uniform": 2164,
    "exist": 2165,
    "a1": 2166,
    "diff": 2167,
    "__init__": 2168,
    "temporary": 2169,
    "deep": 2170,
    "lowest": 2171,
    "batch": 2172,
    "2\\": 2173,
    "bias": 2174,
    "dat": 2175,
    "la": 2176,
    "logisticregression": 2177,
    "pt": 2178,
    "film": 2179,
    "wide": 2180,
    "extend": 2181,
    "interaction": 2182,
    "flat": 2183,
    "highly": 2184,
    "direct": 2185,
    "manually": 2186,
    "hence": 2187,
    "follow": 2188,
    "union": 2189,
    "sizes": 2190,
    "63": 2191,
    "93": 2192,
    "enabled": 2193,
    "mixing": 2194,
    "timezone": 2195,
    "deviation": 2196,
    "cumulative": 2197,
    "num": 2198,
    "fourier": 2199,
    "distributions": 2200,
    "load_iris": 2201,
    "agglomerative": 2202,
    "pseudopotential": 2203,
    "imolecule": 2204,
    "get_nn_info": 2205,
    "csm": 2206,
    "party": 2207,
    "members": 2208,
    "wikipedia": 2209,
    "87": 2210,
    "unlike": 2211,
    "expand": 2212,
    "cumsum": 2213,
    "distributed": 2214,
    "broadcast": 2215,
    "interpolate": 2216,
    "overall": 2217,
    "compressed": 2218,
    "enum": 2219,
    "\\begin": 2220,
    "monotonic": 2221,
    "identify": 2222,
    "symmetric": 2223,
    "ar": 2224,
    "randomforestclassifier": 2225,
    "train_test_split": 2226,
    "he": 2227,
    "chgcar": 2228,
    "v2022": 2229,
    "supercell": 2230,
    "waveder": 2231,
    "slabentry": 2232,
    "hull": 2233,
    "scatter": 2234,
    "enable": 2235,
    "categoricaldtype": 2236,
    "caching": 2237,
    "purpose": 2238,
    "dictionaries": 2239,
    "subplots": 2240,
    "concentration": 2241,
    "sort_values": 2242,
    "separated": 2243,
    "bbb": 2244,
    "collection": 2245,
    "significant": 2246,
    "super": 2247,
    "replaced": 2248,
    "directions": 2249,
    "solid": 2250,
    "workers": 2251,
    "x\\": 2252,
    "formulation": 2253,
    "multinomial": 2254,
    "sequential": 2255,
    "face": 2256,
    "boltztrapanalyzer": 2257,
    "kpoints_updates": 2258,
    "nb_set": 2259,
    "introduction": 2260,
    "tool": 2261,
    "grouping": 2262,
    "locally": 2263,
    "scientific": 2264,
    "science": 2265,
    "things": 2266,
    "approximate": 2267,
    "index_col": 2268,
    "assume": 2269,
    "74": 2270,
    "de": 2271,
    "240": 2272,
    "111": 2273,
    "duplicates": 2274,
    "convention": 2275,
    "transpose": 2276,
    "shared": 2277,
    "3d": 2278,
    "stringdtype": 2279,
    "until": 2280,
    "\\end": 2281,
    "colors": 2282,
    "interpolation": 2283,
    "cls": 2284,
    "successive": 2285,
    "fastica": 2286,
    "hyperparameter": 2287,
    "surfaces": 2288,
    "verbosity": 2289,
    "spacegroupanalyzer": 2290,
    "converged": 2291,
    "hkl": 2292,
    "pourbaixentry": 2293,
    "3x1": 2294,
    "understanding": 2295,
    "84": 2296,
    "509059": 2297,
    "possibly": 2298,
    "94": 2299,
    "239": 2300,
    "observed": 2301,
    "repeated": 2302,
    "2001": 2303,
    "df4": 2304,
    "sensitive": 2305,
    "limits": 2306,
    "signed": 2307,
    "degree": 2308,
    "pi": 2309,
    "1\\": 2310,
    "poisson": 2311,
    "analyzer": 2312,
    "lapack": 2313,
    "nditer": 2314,
    "centered": 2315,
    "transformers": 2316,
    "minibatchkmeans": 2317,
    "kbinsdiscretizer": 2318,
    "n_classes": 2319,
    "illustration": 2320,
    "channel": 2321,
    "bulk": 2322,
    "spacegroup": 2323,
    "voigt": 2324,
    "molecules_allowed": 2325,
    "to_abivars": 2326,
    "solvent": 2327,
    "material": 2328,
    "frequently": 2329,
    "patterns": 2330,
    "styles": 2331,
    "indexers": 2332,
    "calendar": 2333,
    "txt": 2334,
    "fail": 2335,
    "let": 2336,
    "lot": 2337,
    "extended": 2338,
    "analyze": 2339,
    "removing": 2340,
    "alternatively": 2341,
    "preferred": 2342,
    "finally": 2343,
    "sqrt": 2344,
    "specification": 2345,
    "normalization": 2346,
    "br": 2347,
    "yet": 2348,
    "confusion": 2349,
    "minimization": 2350,
    "folder": 2351,
    "don\u2019t": 2352,
    "candidates": 2353,
    "\\x00": 2354,
    "margin": 2355,
    "nb": 2356,
    "polarized": 2357,
    "atomicmetadata": 2358,
    "background": 2359,
    "assumes": 2360,
    "public": 2361,
    "businessday": 2362,
    "contained": 2363,
    "betr801": 2364,
    "xlabel": 2365,
    "locations": 2366,
    "to_datetime": 2367,
    "85": 2368,
    "exists": 2369,
    "int8": 2370,
    "regex": 2371,
    "outside": 2372,
    "turn": 2373,
    "visualize": 2374,
    "v3": 2375,
    "memmap": 2376,
    "ir": 2377,
    "bader": 2378,
    "substrate": 2379,
    "insertionelectrode": 2380,
    "ismear": 2381,
    "elastictensorexpansion": 2382,
    "coords_are_cartesian": 2383,
    "tabular": 2384,
    "filling": 2385,
    "custombusinessday": 2386,
    "characteristic": 2387,
    "again": 2388,
    "london": 2389,
    "become": 2390,
    "mapped": 2391,
    "62": 2392,
    "150": 2393,
    "241": 2394,
    "243": 2395,
    "69": 2396,
    "record": 2397,
    "proper": 2398,
    "forward": 2399,
    "exp": 2400,
    "wrapper": 2401,
    "cs": 2402,
    "reason": 2403,
    "backward": 2404,
    "decimal": 2405,
    "runtime": 2406,
    "latest": 2407,
    "minor": 2408,
    "balanced": 2409,
    "b0": 2410,
    "compiled": 2411,
    "001": 2412,
    "nonzero": 2413,
    "gil": 2414,
    "separating": 2415,
    "inputfile": 2416,
    "doscar": 2417,
    "pawxmlsetup": 2418,
    "dielectricfunctioncalculator": 2419,
    "programming": 2420,
    "monthbegin": 2421,
    "micro": 2422,
    "gitpod": 2423,
    "incompatible": 2424,
    "commands": 2425,
    "home": 2426,
    "interested": 2427,
    "thur": 2428,
    "65": 2429,
    "nth": 2430,
    "dummy": 2431,
    "iterable": 2432,
    "later": 2433,
    "treated": 2434,
    "onto": 2435,
    "2009": 2436,
    "increase": 2437,
    "register": 2438,
    "typedef": 2439,
    "keepdims": 2440,
    "polynomials": 2441,
    "bi": 2442,
    "recognition": 2443,
    "lars": 2444,
    "handwritten": 2445,
    "make_scorer": 2446,
    "ledoit": 2447,
    "hyperplane": 2448,
    "site_properties": 2449,
    "icohplist": 2450,
    "structurematcher": 2451,
    "sort_structure": 2452,
    "apps": 2453,
    "structure_environments": 2454,
    "basicmultidataset": 2455,
    "instructions": 2456,
    "windowing": 2457,
    "cookbook": 2458,
    "hashing": 2459,
    "custombusinesshour": 2460,
    "theory": 2461,
    "83": 2462,
    "calculating": 2463,
    "counting": 2464,
    "fillna": 2465,
    "increasing": 2466,
    "params": 2467,
    "ba": 2468,
    "iterators": 2469,
    "uncertainty": 2470,
    "standardize": 2471,
    "estimated": 2472,
    "jobs": 2473,
    "\u2018": 2474,
    "\u201c": 2475,
    "determination": 2476,
    "npyiter": 2477,
    "ward": 2478,
    "centroid": 2479,
    "vdw": 2480,
    "user_kpoints_settings": 2481,
    "conversionvoltagepair": 2482,
